def area(a, b):
    '''
        Функция для вычисления площади прямоугольника
        Параметры:
            a: длина стороны прямоугольника
            b: длина стороны прямоугольника
        Возвращаемое значение:
            площадь прямоугольника
        Пример:
            Входной параметр: 3, 4
            Возвращаемое значение: 3 * 4 = 12
        '''
    return a * b


def perimeter(a, b):
    '''
         Функция для вычисления периметра прямоугольника
         Параметры:
            a: длина стороны прямоугольника
         Возвращаемое значение:
            периметр прямоугольника
         Пример:
            Входной параметр: 3, 4
            Возвращаемое значение: 14
    '''
    return 2*a + 2*b
