def area(a):
    '''
        Функция для вычисления площади квадрата
        Параметры:
            a: длина стороны квадрата
        Возвращаемое значение:
            площадь квадрата
        Пример:
            Входной параметр: 3
            Возвращаемое значение: 3 * 3 = 9
        '''
    return a * a


def perimeter(a):
    '''
         Функция для вычисления периметра квадрата
         Параметры:
            a: длина стороны квадрата
         Возвращаемое значение:
            периметр квадрата
         Пример:
            Входной параметр: 3.2
            Возвращаемое значение: 4 * 3.2 = 12.8
    '''
    return 4 * a
